# Terraform - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/shared/terraform/workspaces/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/production/runs/run-oovZ7M8f31oE1AGJ

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
data.tfe_organization.default: Refreshing...
data.tfe_organization.default: Refresh complete after 0s [id=org-5y3MEgeuSg9nz1bX]
tfe_project.default: Refreshing state... [id=prj-Ypb929xZ3ud4DFWL]
data.tfe_workspace.default: Refreshing...
module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-qDvxgbEWdy8JAJg3]
module.identity.tfe_workspace.identity: Refreshing state... [id=ws-T2CHFSgXk1mWAEiK]
module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-fpMbsEfUqbxPrjtW]
module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-fqEb4Q3qhSyXf5ev]
module.customer.tfe_workspace.customer: Refreshing state... [id=ws-puJfbRKD4QSNyk2o]
module.organization.tfe_workspace.organization: Refreshing state... [id=ws-nWeQ4VMWb4niqKEb]
data.tfe_workspace.default: Refresh complete after 0s [id=ws-UmJqcbXkYoY7jfTM]
data.tfe_variables.default: Refreshing...
module.identity.tfe_variable.identity_api_aws_access_key_id: Refreshing state... [id=var-LBP1qA4rwDAPmrBG]
module.identity.tfe_variable.identity_api_aws_secret_access_key: Refreshing state... [id=var-T1Qogdhg9GNJzxw8]
module.identity.tfe_variable.identity_api_cockroach_api_key: Refreshing state... [id=var-JcMiHRvmPSSSr3JR]
module.organization.tfe_variable.organization_api_aws_secret_access_key: Refreshing state... [id=var-yDD8Rxs3zKJPCaTP]
module.organization.tfe_variable.organization_api_aws_access_key_id: Refreshing state... [id=var-7FQCfXAzeSZNsyvm]
module.organization.tfe_variable.organization_api_cockroach_api_key: Refreshing state... [id=var-GsNRj4ZUszrmfvpx]
module.identity.tfe_variable.identity_aws_secret_access_key: Refreshing state... [id=var-v5rUHBx3hnAqf8EU]
module.identity.tfe_variable.identity_aws_access_key_id: Refreshing state... [id=var-RJ8QTjP4oSqTXcMU]
data.tfe_variables.default: Refresh complete after 0s [id=variables/ws-UmJqcbXkYoY7jfTM]
module.identity.tfe_variable.identity_cockroach_api_key: Refreshing state... [id=var-Qt3LLvwfD8j2BYv7]
module.organization.tfe_variable.organization_aws_access_key_id: Refreshing state... [id=var-StWu3aUPDPVAEJnx]
module.organization.tfe_variable.organization_cockroach_api_key: Refreshing state... [id=var-4Xxjb5r2nza4kknd]
module.organization.tfe_variable.organization_aws_secret_access_key: Refreshing state... [id=var-YhtQo8LQ3kb9gQtj]
module.customer.tfe_variable.customer_api_aws_secret_access_key: Refreshing state... [id=var-oSE524WGbAWrEMVE]
module.customer.tfe_variable.customer_api_aws_access_key_id: Refreshing state... [id=var-TmBDwhdrHRv8svx9]
module.customer.tfe_variable.customer_api_cockroach_api_key: Refreshing state... [id=var-zU98QY68PyZWgWNY]
module.customer.tfe_variable.customer_aws_secret_access_key: Refreshing state... [id=var-vekDd67krpaAbwSL]
module.customer.tfe_variable.customer_aws_access_key_id: Refreshing state... [id=var-SuZCQPwTmnyMRXX8]
module.customer.tfe_variable.customer_cockroach_api_key: Refreshing state... [id=var-VBkDdzo8C6RdkqBE]
module.identity.tfe_workspace.identity_api: Drift detected (update)
module.identity.tfe_workspace.identity: Drift detected (update)
module.organization.tfe_workspace.organization: Drift detected (update)
module.organization.tfe_workspace.organization_api: Drift detected (update)
module.customer.tfe_workspace.customer: Drift detected (update)
module.customer.tfe_workspace.customer_api: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.shared.tfe_variable.shared_aws_access_key_id will be created
  + resource "tfe_variable" "shared_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.shared.tfe_variable.shared_aws_secret_access_key will be created
  + resource "tfe_variable" "shared_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.shared.tfe_variable.shared_cockroach_api_key will be created
  + resource "tfe_variable" "shared_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.shared.tfe_workspace.shared will be created
  + resource "tfe_workspace" "shared" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production-shared"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = "prj-Ypb929xZ3ud4DFWL"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "production",
          + "shared",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/shared/infrastructure/workspaces/production"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*